streetCanyon_CFDHAM_grass/constant/leeward/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
   version     2.0;
   format      ascii;
   class       dictionary;
   object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
  (59.91 0.00 100.00)
  (60.00 0.00 100.00)
  (60.00 10.00 100.00)
  (59.91 10.00 100.00)
  (59.91 0.00 150.00)
  (60.00 0.00 150.00)
  (60.00 10.00 150.00)
  (59.91 10.00 150.00)
);
 
blocks
(
  hex (0 1 2 3 4 5 6 7) (20 20 100) simpleGrading (((0.5 0.5 10)(0.5 0.5 0.1)) 1 1)
);
 
edges
(
);
 
patches
(
  patch leeward_to_air
  (
      (1 5 6 2)    
  )
  patch interior
  (
      (0 4 7 3)
  )
  patch top
  (
      (3 2 6 7)
  )
  patch bottom
  (
      (0 1 5 4)
  )
  patch sides
  (
      (0 1 2 3)
      (4 5 6 7)
  )
);
 
mergePatchPairs
(
);

// ************************************************************************* //
